# Pandas

Pandas is an open source data analysis library written in python

it provides rish and ghighly special data operation 

its key data structure is data frame

we can analyse : 1) series 2) dataframe

1.series ---> 1D array
2.Dataframe ---> 2D array

### Creating pandas series

it's a 1D array with indexes , it sotres a single column or row of data in a dataframe.

#### Making sries object using python Data structures

List , Tuple , set , dictionary

In [3]:
# from List
import pandas as pd

obj = pd.Series([1,2,3,4,5])
print(obj)
print("type is :",type(obj))
print("indexes abd step size:",obj.axes)
print("number of elements:",obj.size)

0    1
1    2
2    3
3    4
4    5
dtype: int64
type is : <class 'pandas.core.series.Series'>
indexes abd step size: [RangeIndex(start=0, stop=5, step=1)]
number of elements: 5

### Changing Index Labels

In [7]:
obj = pd.Series([1,2,3,4,5],index=[8,5,3,2,1])
print(obj)
print("indexes:",obj.axes)

8    1
5    2
3    3
2    4
1    5
dtype: int64
indexes: [Index([8, 5, 3, 2, 1], dtype='int64')]

In [10]:
#sorting index
obj = pd.Series([1,2,3,4,5],index=[8,5,3,2,1])
print(obj.sort_index())

1    5
2    4
3    3
5    2
8    1
dtype: int64

In [11]:
obj = pd.Series([1,2,3,4,5],index=["fisrt","second","third","fourth","fith"])
obj

fisrt     1
second    2
third     3
fourth    4
fith      5
dtype: int64

In [12]:
obj['fourth']

4

In [13]:
obj.index

Index(['fisrt', 'second', 'third', 'fourth', 'fith'], dtype='object')

In [14]:
list(obj.items())

[('fisrt', 1), ('second', 2), ('third', 3), ('fourth', 4), ('fith', 5)]

##### as similar  to numpy arrays it also stores data of same data type...check below example

In [19]:
obj = pd.Series([2,3,4,5,6,5.6])
obj

0    2.0
1    3.0
2    4.0
3    5.0
4    6.0
5    5.6
dtype: float64

In [20]:
obj = pd.Series([2,3,4,5,6,2j+3])
obj

0    2.0+0.0j
1    3.0+0.0j
2    4.0+0.0j
3    5.0+0.0j
4    6.0+0.0j
5    3.0+2.0j
dtype: complex128

In [21]:
obj = pd.Series([2,3,4,5,6,"hk"])
obj

0     2
1     3
2     4
3     5
4     6
5    hk
dtype: object

In [22]:
# from tuple
obj = pd.Series((1,2,3,4,5))
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [23]:
# from string
obj = pd.Series(["python","sql","Machine"])
obj

0     python
1        sql
2    Machine
dtype: object

In [25]:
# obj = pd.Series("python","sql")
# obj

### Creating series using numpy arrays

In [26]:
import numpy as np
arr = np.array([1,2,3,4])
obj = pd.Series(arr)
obj

0    1
1    2
2    3
3    4
dtype: int32

In [27]:
obj = pd.Series(np.array([1,2,3,4]))
obj

0    1
1    2
2    3
3    4
dtype: int32

In [31]:
np.random.seed(234)
obj = pd.Series(np.random.rand(5)).round(3)
obj

0    0.031
1    0.254
2    0.912
3    0.970
4    0.247
dtype: float64

In [32]:
# dictionary

obj = pd.Series({
    "jan":300,
    "feb":400,
    "march":500
})
obj

jan      300
feb      400
march    500
dtype: int64

### Merging two series

In [2]:
import pandas as pd

obj1 = pd.Series([1,2,3,4,5])
obj2 = pd.Series([20,30,12,3,4,2,3,5])

obj1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
obj2

0    20
1    30
2    12
3     3
4     4
5     2
6     3
7     5
dtype: int64

In [5]:
pd.concat([obj1,obj2]) #concat()

0     1
1     2
2     3
3     4
4     5
0    20
1    30
2    12
3     3
4     4
5     2
6     3
7     5
dtype: int64

### selection in pandas series

In [6]:
obj1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
obj1[1]

2

In [8]:
obj1[1:4]

1    2
2    3
3    4
dtype: int64

In [9]:
obj1[:4]

0    1
1    2
2    3
3    4
dtype: int64

In [13]:
## fancy selection

In [15]:
obj1[[2,4]]

2    3
4    5
dtype: int64

### membership operator

In [10]:
obj1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
3 in obj1

True

In [12]:
100 in obj1

False

### Updating Valus

In [16]:
obj1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [17]:
obj1[3] = 500 # we can assign new values

In [18]:
obj1

0      1
1      2
2      3
3    500
4      5
dtype: int64

## Data Frames

A DataFrame is a data structure that organizes data into a 2-dimensional table of rows and columns, much like a spreadsheet. DataFrames are one of the most common data structures used in modern data analytics because they are a flexible and intuitive way of storing and working with data.

In [20]:
df = pd.DataFrame({
    "Name":["Ashwini","Anmol","virat"],
    "Age":[21,22,25]
})

df

      Name  Age
0  Ashwini   21
1    Anmol   22
2    virat   25

In [22]:
df['Age']

0    21
1    22
2    25
Name: Age, dtype: int64

In [23]:
df.Age

0    21
1    22
2    25
Name: Age, dtype: int64

In [26]:
l = ["Ashwini","Anmol","virat","rohit",'bhuvi'] # using list
df = pd.DataFrame(l,columns=["Name"])
df

      Name
0  Ashwini
1    Anmol
2    virat
3    rohit
4    bhuvi

In [27]:
### Creating dataframe with numpy array

In [28]:
import numpy as np
np.random.seed(2)
arr = np.random.randint(1,20,12).reshape(4,3)
arr

array([[ 9, 16, 14],
       [ 9, 12, 19],
       [12,  9,  8],
       [ 3, 18, 12]])

In [29]:
df = pd.DataFrame(arr,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     9    16    14
1     9    12    19
2    12     9     8
3     3    18    12

### Attributes of DataFrame

In [31]:
df

   var1  var2  var3
0     9    16    14
1     9    12    19
2    12     9     8
3     3    18    12

In [32]:
df.shape

(4, 3)

In [33]:
df.ndim

2

In [34]:
df.size

12

In [35]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [36]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [37]:
df.values

array([[ 9, 16, 14],
       [ 9, 12, 19],
       [12,  9,  8],
       [ 3, 18, 12]])

In [39]:
df.columns = (['col1','col2','col3'])
df

   col1  col2  col3
0     9    16    14
1     9    12    19
2    12     9     8
3     3    18    12

### Access rows of a dataframe

In [41]:
df = pd.DataFrame({
    "Name":["Ashwini","Anmol","virat","rohit",'bhuvi'],
    "Income":[30000,40000,2000,30000,5000],
    "Age":[21,23,24,40,21]
})
df

      Name  Income  Age
0  Ashwini   30000   21
1    Anmol   40000   23
2    virat    2000   24
3    rohit   30000   40
4    bhuvi    5000   21

### iloc keyword

in order to reach rows by their integer location , we can use iloc keyword

In [42]:
df.iloc[0]

Name      Ashwini
Income      30000
Age            21
Name: 0, dtype: object

In [43]:
#fancy way
df.iloc[[1,2]]

    Name  Income  Age
1  Anmol   40000   23
2  virat    2000   24

In [44]:
# specific column 
df.iloc[[1,2],0]

1    Anmol
2    virat
Name: Name, dtype: object

In [46]:
df.iloc[[1,2],[0,1]]

    Name  Income
1  Anmol   40000
2  virat    2000

In [47]:
df.iloc[1:3]

    Name  Income  Age
1  Anmol   40000   23
2  virat    2000   24

### loc keyword

In [48]:
df

      Name  Income  Age
0  Ashwini   30000   21
1    Anmol   40000   23
2    virat    2000   24
3    rohit   30000   40
4    bhuvi    5000   21

In [49]:
df.loc[0]

Name      Ashwini
Income      30000
Age            21
Name: 0, dtype: object

In [51]:
df.loc[[1,2],"Age"]

1    23
2    24
Name: Age, dtype: int64

In [55]:
df.loc["a"]

Name      Anmol
Income    40000
Age          23
Name: 1, dtype: object